use ErpBill
go

--幂等性（调用一次或无数次，后果一样）脚本

---------------表相关操作---------------

--新增表AppVisit，使用LIS中该表的脚本

--INF_INPT_PKT_DTL_C
IF not EXISTS (select 1 from syscolumns where name='Amount' and id=object_id('INF_INPT_PKT_DTL_C'))
  Alter table INF_INPT_PKT_DTL_C add Amount varchar(50) null
GO


---------------函数相关操作---------------

---------------存储过程相关操作---------------

---------------视图相关操作---------------

---------------触发器相关操作---------------

---------------数据相关操作---------------

---------------表约束、索引相关操作---------------

---------------表关系相关操作---------------

---------------重新编译视图---------------